cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'jesseduffield/lazygit'

#tap 'homebrew/completions'

#brew 'go-delve/delve/delve'

brew 'ack'
brew 'ag'
brew 'bash-completion'
brew 'brew-gem'
brew 'bvi'
brew 'assimp'
brew 'clang-format'
brew 'coreutils'
brew 'ctags'
brew 'dep'
brew 'docker-completion'
brew 'docker-compose-completion'
brew 'docker-machine-completion'
brew 'exa'
brew 'fzf'
brew 'go'
brew 'graphviz'
brew 'grc'
brew 'htop'
brew 'hugo'
brew 'iftop'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'lazygit'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'neofetch'
brew 'neovim'
brew 'node'
brew 'openssl'
brew 'pv'
brew 'readline'
brew 'shellcheck'
brew 'spaceman-diff'
brew 'tldr'
brew 'tmux'
brew 'tree'
brew 'unrar'
brew 'vim'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'

## HACK: In order to install delve https://github.com/go-delve/homebrew-delve/issues/19#issuecomment-330442033
# cd $HOME/Library/Caches/Homebrew
# tar xf delve-*.gz
# go into directory ( mine is delve-1.0.0-rc.1 )
# sh scripts/gencert.sh

###
###
###

#cask 'cyberduck'
#cask 'postico'
cask 'beyond-compare'
cask 'dash'
cask 'docker'
cask 'etcher'
cask 'firefox'
cask 'gitup'
cask 'google-chrome'
cask 'iTerm2'
cask 'java'
cask 'LastPass'
cask 'macdown'
cask 'mysqlworkbench'
cask 'omnidisksweeper'
cask 'p4v'
cask 'perforce'
cask 'rowanj-gitx'
cask 'sequel-pro'
cask 'slack'
cask 'sublime-text'
cask 'visual-studio-code'
cask 'vlc'
cask 'xquartz'

cask 'quicklook-pfm'
#cask 'qlmarkdown'
cask 'MeshQuickLookPlugin'
cask 'QLMarkdownGFM'
cask 'QLColorCode'

