cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'jesseduffield/lazygit'
tap 'thii/xcbeautify'

brew 'ack'
brew 'ag'
brew 'assimp'
brew 'bash-completion'
brew 'brew-gem'
brew 'bvi'
brew 'clang-format'
brew 'coreutils'
brew 'ctags'
brew 'docker-completion'
brew 'docker-compose-completion'
brew 'docker-machine-completion'
brew 'exa'
brew 'fzf'
brew 'go'
brew 'graphviz'
brew 'grc'
brew 'htop'
brew 'hugo'
brew 'iftop'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'lazygit'
brew 'libgit2'
brew 'neofetch'
brew 'neovim'
brew 'node'
brew 'openssl'
brew 'pv'
brew 'readline'
brew 'ripgrep'
brew 'sdl2'
brew 'shellcheck'
brew 'spaceman-diff'
brew 'tldr'
brew 'tmux'
brew 'tree'
brew 'unrar'
brew 'vim'
brew 'wget'
brew 'xcbeautify'
brew 'youtube-dl'


###
###
###

cask 'balenaetcher'
cask 'beyond-compare'
cask 'dash'
cask 'docker'
cask 'gitup'
cask 'iTerm2'
cask 'java'
cask 'macdown'
cask 'omnidisksweeper'
cask 'sublime-text'
cask 'vlc'

