cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/completions'

brew 'ack'
brew 'ag'
brew 'brew-gem'
brew 'bvi'
brew 'coreutils'
brew 'ctags'
brew 'exa'
brew 'docker-completion'
brew 'docker-compose-completion'
brew 'docker-machine-completion'
brew 'fzf'
brew 'go'
brew 'grc'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'neovim'
brew 'node'
brew 'openssl'
brew 'pv'
brew 'htop'
brew 'readline'
brew 'shellcheck'
brew 'spaceman-diff'
brew 'tldr'
brew 'tmux'
brew 'unrar'
brew 'vim'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'


###
###
###

cask 'beyond-compare'
cask 'cyberduck'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'LastPass'
cask 'iTerm2'
cask 'omnidisksweeper'
cask 'p4v'
cask 'perforce'
cask 'slack'
cask 'sublime-text'
cask 'visual-studio-code'
cask 'vlc'
cask 'xquartz'
